src/app/controllers/goals_controller.rb

  def index
    @goals = current_user.goals.all
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`user_id` = 1